# <center> Joining and Merging

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

## Lets create 2 dictionaries for building a DataFrame

In [2]:
names = pd.DataFrame({'id': [1,2,3,4,5],
                    'name': ['Anna','Bob','Charles','Daniel','Evan']})

In [3]:
ages = pd.DataFrame({'id':[1,2,3,4,5],'age':[20,30,40,50,60]})

#### Now when we have two separate data frames which are related to one another, we can combine them into one data frame. It is important that we have a common column that we can merge on. In this case, this is id.

In [4]:
df = pd.merge(names,ages,on = 'id')
df

   id     name  age
0   1     Anna   20
1   2      Bob   30
2   3  Charles   40
3   4   Daniel   50
4   5     Evan   60

In [5]:
df.set_index('id' , inplace= True)

In [6]:
df

       name  age
id
1      Anna   20
2       Bob   30
3   Charles   40
4    Daniel   50
5      Evan   60

## Joins

#### It is not necessarily always obvious how we want to merge our dataframes. This is where joins come into play. We have four types of joins.

# LEFT
# RIGHT
# OUTER
# INNER

#### Now lets change our two dataframes a little bit

In [7]:
names = pd.DataFrame({'id':[1,2,3,4,5,6],'names':['Anna','Bob','Charles','Daniel','Evan','Fiona']})
ages = pd.DataFrame({'id':[1,2,3,4,5,7],'age':[20,30,40,50,60,70]})

In [8]:
df = pd.merge(names,ages,on='id')
df.set_index('id',inplace= True)

In [9]:
df

      names  age
id
1      Anna   20
2       Bob   30
3   Charles   40
4    Daniel   50
5      Evan   60

#### If we now perform the default inner join, we will end up with the same dataframe as in the beginning. We only takes the keys which both objects have. This means one to five.

In [10]:
df = pd.merge(names, ages , on ='id' , how = 'left')
df.set_index('id', inplace= True)

In [11]:
df

      names   age
id
1      Anna  20.0
2       Bob  30.0
3   Charles  40.0
4    Daniel  50.0
5      Evan  60.0
6     Fiona   NaN

#### When we use the left join, we get all the keys from the names dataframe but not te additional index 7 from ages. This also means Fiona won't be assigned any age. The same principle goes for the right join just the other way around.

In [12]:
df = pd.merge(names , ages , on ='id' , how ='right')

In [13]:
df.set_index('id', inplace= True)

In [14]:
df

      names  age
id
1      Anna   20
2       Bob   30
3   Charles   40
4    Daniel   50
5      Evan   60
7       NaN   70

#### Now, we only we have the keys from the ages frame and the 6 is missing. Finally if we use the outer join, we combine all keys into one dataframe.

In [15]:
df = pd.merge(names, ages , on = 'id' , how = 'outer')
df.set_index('id', inplace=True)

In [16]:
df

      names   age
id
1      Anna  20.0
2       Bob  30.0
3   Charles  40.0
4    Daniel  50.0
5      Evan  60.0
6     Fiona   NaN
7       NaN  70.0